# TrussFamilyDiagWeb Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
GroupTypeId..::..TrussFamilyDiagWeb Property
GroupTypeId Class See Also
---
Diagonal Webs.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2024
# Syntax
C#
---
```text
public static ForgeTypeId TrussFamilyDiagWeb { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property TrussFamilyDiagWeb As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ TrussFamilyDiagWeb {
	ForgeTypeId^ get ();
}
```

# See Also
GroupTypeId Class
Autodesk.Revit.DB Namespace